# Feature Engineering

In this notebook, we will create new features from the existing data to enhance the predictive power of our models.

In [17]:
# Importing necessary libraries
import pandas as pd
import numpy as np

In [18]:
# Loading the dataset
data = pd.read_csv('./data/cleaned_weekly_stock_market.csv')
data.head()

,companyName,date,openingPrice,highestPrice,lowestPrice,closingPrice,volume
0,AMEN BANK,2014-06-16,23.63,23.63,22.75,23.14,1608.0
1,AMEN BANK,2014-06-23,23.14,23.14,22.37,22.75,16837.0
2,AMEN BANK,2014-06-30,22.75,22.97,22.07,22.66,33514.0
3,AMEN BANK,2014-07-07,22.75,23.17,21.88,22.74,3340.0
4,AMEN BANK,2014-07-14,22.84,23.16,22.58,22.75,5789.0

In [19]:
# Extracting date features
data['date'] = pd.to_datetime(data['date'])
data['year'] = data['date'].dt.year
data['month'] = data['date'].dt.month
data['day_of_month'] = data['date'].dt.day
data['week_of_year'] = data['date'].dt.isocalendar().week

data.head()

,companyName,date,openingPrice,highestPrice,lowestPrice,closingPrice,volume,year,month,day_of_month,week_of_year
0,AMEN BANK,2014-06-16,23.63,23.63,22.75,23.14,1608.0,2014,6,16,25
1,AMEN BANK,2014-06-23,23.14,23.14,22.37,22.75,16837.0,2014,6,23,26
2,AMEN BANK,2014-06-30,22.75,22.97,22.07,22.66,33514.0,2014,6,30,27
3,AMEN BANK,2014-07-07,22.75,23.17,21.88,22.74,3340.0,2014,7,7,28
4,AMEN BANK,2014-07-14,22.84,23.16,22.58,22.75,5789.0,2014,7,14,29

In [20]:
# Extracting Price features
data['price_range'] = data['highestPrice'] - data['lowestPrice']
data['price_change'] = data ['closingPrice'] - data['openingPrice']
data['weekly_return'] = ((data['closingPrice'] - data['openingPrice']) / data['openingPrice']) * 100

data.head()

,companyName,date,openingPrice,highestPrice,lowestPrice,closingPrice,volume,year,month,day_of_month,week_of_year,price_range,price_change,weekly_return
0,AMEN BANK,2014-06-16,23.63,23.63,22.75,23.14,1608.0,2014,6,16,25,0.88,-0.49,-2.073635
1,AMEN BANK,2014-06-23,23.14,23.14,22.37,22.75,16837.0,2014,6,23,26,0.77,-0.39,-1.685393
2,AMEN BANK,2014-06-30,22.75,22.97,22.07,22.66,33514.0,2014,6,30,27,0.90,-0.09,-0.395604
3,AMEN BANK,2014-07-07,22.75,23.17,21.88,22.74,3340.0,2014,7,7,28,1.29,-0.01,-0.043956
4,AMEN BANK,2014-07-14,22.84,23.16,22.58,22.75,5789.0,2014,7,14,29,0.58,-0.09,-0.394046